import logo from './logo.svg';
import './App.css';
import { useState } from 'react';

function App() {
    const [toggle, settoggle] = useState(false)
  return (
    <div className="App">

<div className={`container ${(toggle)?'show-nav':null}`}>

<div className="circle-container">
    <div className="circle">
        <button onClick={()=>settoggle(false)} id="close">
            <i className="fas fa-times"></i>
        </button>

        <button onClick={()=>settoggle(true)} id="open">
            <i className="fas fa-bars"></i>
        </button>
    </div>
</div>


<div className="content">
    <h1>محتوای شگفت انگیز</h1>
    <small>فرزاد معصومی</small>
    <p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.
    </p>
    <h3>لپ تاپ من</h3>
    <img src="images/laptop.jpg" alt=""/>
    <p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.
    </p>
</div>

</div>


<nav>
<ul>
    <li><i className="fas fa-home"></i>خانه</li>
    <li><i className="fas fa-user-alt"></i>درباره ما</li>
    <li><i className="fas fa-envelope"></i>تماس با ما</li>
</ul>
</nav>
      
    </div>
  );
}

export default App;
